Revit 2026 API

# BuiltInFailuresProfileFailures Class

---

Failures about Profile.

SystemObject Autodesk.Revit.DBBuiltInFailuresProfileFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ProfileFailures
```
```vb
Public NotInheritable Class ProfileFailures
```
```cpp
public ref class ProfileFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ProfileFailures = class end
```

The BuiltInFailuresProfileFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SketchNotEmpty | Can't move the Profile Plane because the Profile Sketch is not empty. This operation is not supported at this time. |

#### Reference

Autodesk.Revit.DB Namespace